Revit 2024 API
BuiltInFailures.ElectricityFailures Members
Provides a container of all Revit built-in FailureDefinitionId instances.
The BuiltInFailures.ElectricityFailures type exposes the following members.
Properties
Name | Description
FamilyMismatchCircuitDisconnected
 The family no longer matches the properties for the Circuit. Disconnect the family from the Circuit?
InvalidPoleNumber
 The panel is single phase [wire] wires. The number of poles can not be larger than [value].
InvalidSpareLoad
 The spare/space assigned to panel '[Panel Name]' has an invalid load property. To correct this issue, remove and add the spare/space to the panel again.
See Also
BuiltInFailures.ElectricityFailures Class
Autodesk.Revit.DB Namespace